Revit 2024 API
NumberingSchemaType.Inequality Operator
Compares two NumberingSchemaType instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool operator !=(
	NumberingSchemaType first,
	NumberingSchemaType second
)
Visual Basic
Public Shared Operator <> ( _
	first As NumberingSchemaType, _
	second As NumberingSchemaType _
) As Boolean
Visual C++
public:
static bool operator !=(
	NumberingSchemaType^ first,
	NumberingSchemaType^ second
)
Parameters
first
Type: Autodesk.Revit.DB.NumberingSchemaType
The first NumberingSchemaType.
second
Type: Autodesk.Revit.DB.NumberingSchemaType
The second NumberingSchemaType.
Return Value
True if the inputs are different, false if they are identical.
See Also
NumberingSchemaType Class
Autodesk.Revit.DB Namespace